micropython/micropython/ports/stm32/eth.c
    // Allocate TX buffer slots.
    unsigned int idx = 0;
    for (struct pbuf *pb = p; pb != NULL; pb = pb->next) {
        int ret = eth_tx_buf_get_ref(pb->len, pb->payload, idx++);
        if (ret != 0) {
            if (made_pbuf_copy) {
                pbuf_free(p);
            }
            return ERR_BUF;
        }
    }

    // Take references to pbufs
    idx = 0;
    for (struct pbuf *pb = p; pb != NULL; pb = pb->next) {
        unsigned int tx_idx = (eth_dma_tx_descr_idx + idx) % TX_BUF_NUM;
        if (eth_dma_pbuf[tx_idx] != NULL) {
            pbuf_free(eth_dma_pbuf[tx_idx]);
        }
        if (!made_pbuf_copy) {
            pbuf_ref(pb);
        }
        eth_dma_pbuf[tx_idx] = pb;
        ++idx;
    }

    // Start the transmission.
    int ret = eth_tx_buf_send(num_segments);

    #else

    // Allocate TX slot, copy the pbuf, and start the transmission.
    uint8_t *buf;
    int ret = eth_tx_buf_get(p->tot_len, &buf);
    if (ret == 0) {
        pbuf_copy_partial(p, buf, p->tot_len, 0);
        ret = eth_tx_buf_send(1);
    }

    #endif

    return ret ? ERR_BUF : ERR_OK;
}

static err_t eth_netif_init(struct netif *netif) {
    netif->linkoutput = eth_netif_output;
    netif->output = etharp_output;
    netif->mtu = 1500;
    netif->flags = NETIF_FLAG_BROADCAST | NETIF_FLAG_ETHARP | NETIF_FLAG_ETHERNET | NETIF_FLAG_IGMP;
    // Checksums only need to be checked on incoming frames, not computed on outgoing frames
    NETIF_SET_CHECKSUM_CTRL(netif,
        NETIF_CHECKSUM_CHECK_IP
        | NETIF_CHECKSUM_CHECK_UDP
        | NETIF_CHECKSUM_CHECK_TCP
        | NETIF_CHECKSUM_CHECK_ICMP
        | NETIF_CHECKSUM_CHECK_ICMP6);
    return ERR_OK;
}

static void eth_lwip_init(eth_t *self) {
    ip_addr_t ipconfig[4];
    IP4_ADDR(&ipconfig[0], 0, 0, 0, 0);
    IP4_ADDR(&ipconfig[2], 192, 168, 0, 1);
    IP4_ADDR(&ipconfig[1], 255, 255, 255, 0);
    IP4_ADDR(&ipconfig[3], 8, 8, 8, 8);

    MICROPY_PY_LWIP_ENTER

    struct netif *n = &self->netif;
    n->name[0] = 'e';
    n->name[1] = '0';
    netif_add(n, &ipconfig[0], &ipconfig[1], &ipconfig[2], self, eth_netif_init, ethernet_input);
    netif_set_hostname(n, mod_network_hostname_data);

    dns_setserver(0, &ipconfig[3]);
    dhcp_set_struct(n, &self->dhcp_struct);

    // netif_set_default(), netif_set_up(), netif_set_link_up() and dhcp_start()
    // are deferred. They are called from eth_start() (interface up) and from
    // eth_phy_link_status_poll() (link up after autonegotiation).

    MICROPY_PY_LWIP_EXIT
}

// Reset the PHY and start autonegotiation. Does not wait for completion.
static int eth_phy_init(eth_t *self) {
    self->phy_init(self->phy_addr);

    // Wait for the soft reset to complete (typically a few ms). This is
    // bounded; we do not wait for link or autonegotiation here.
    uint32_t t0 = mp_hal_ticks_ms();
    while (eth_phy_read(self->phy_addr, PHY_BCR) & PHY_BCR_SOFT_RESET) {
        if (mp_hal_ticks_ms() - t0 > 1000) {
            return -MP_ETIMEDOUT;
        }
        mp_hal_delay_ms(2);
    }

    // Advertise all 10/100 modes.
    eth_phy_write(self->phy_addr, PHY_ANAR,
        PHY_ANAR_SPEED_10HALF |
        PHY_ANAR_SPEED_10FULL |
        PHY_ANAR_SPEED_100HALF |
        PHY_ANAR_SPEED_100FULL |
        PHY_ANAR_IEEE802_3);

    // For gigabit-capable PHYs, also advertise 1000Mbit.
    eth_phy_write(self->phy_addr, PHY_1000BTCR,
        PHY_1000BTCR_1000HALF | PHY_1000BTCR_1000FULL);

    // Start (or restart) autonegotiation.
    eth_phy_write(self->phy_addr, PHY_BCR, PHY_BCR_AUTONEG_EN | PHY_BCR_AUTONEG_RESTART);

    self->autoneg_start_ms = mp_hal_ticks_ms();
    return 0;
}

// Restart DHCP if no static IP is configured. Used when link comes up, MAC is
// reconfigured, or the interface starts.
static void eth_dhcp_restart_if_needed(struct netif *netif) {
    if (netif_is_up(netif) && ip4_addr_isany_val(*netif_ip4_addr(netif))) {
        if (netif_dhcp_data(netif) != NULL) {
            dhcp_stop(netif);
        }
        dhcp_start(netif);
    }
}

// Poll PHY link status and react to changes. Called from the lwIP poll loop.
//
// State machine:
//   - link down -> link up: mark link up, start DHCP (or use static IP),
//     wait for autoneg to complete, then reconfigure MAC speed/duplex.
//   - link up -> link down: stop DHCP, mark link down.
//   - autoneg complete after link up: configure MAC speed/duplex from PHY.
void eth_phy_link_status_poll(void) {
    eth_t *self = &eth_instance;
    if (!self->enabled) {
        return;
    }

    // PHY_BSR link status bit is latched-low (IEEE 802.3): read twice to get
    // the current state (first read clears any latched events).
    (void)eth_phy_read(self->phy_addr, PHY_BSR);
    uint16_t bsr = eth_phy_read(self->phy_addr, PHY_BSR);
    bool current_link_status = (bsr & PHY_BSR_LINK_STATUS) != 0;

    // Handle link up/down transitions.
    if (current_link_status != self->last_link_status) {
        self->last_link_status = current_link_status;
        struct netif *netif = &self->netif;
        MICROPY_PY_LWIP_ENTER
        if (current_link_status) {
            netif_set_link_up(netif);
            self->mac_speed_configured = false;
            self->autoneg_start_ms = mp_hal_ticks_ms();
            eth_dhcp_restart_if_needed(netif);
        } else {
            netif_set_link_down(netif);
            self->mac_speed_configured = false;
            if (netif_dhcp_data(netif) != NULL) {
                if (dhcp_supplied_address(netif)) {
                    // DHCP assigned this IP: clear it so DHCP restarts on link-up.
                    ip4_addr_set_zero(&netif->ip_addr);
                }
                dhcp_stop(netif);
            }
        }
        MICROPY_PY_LWIP_EXIT
    }

    // If link is up but MAC speed/duplex not yet configured, check if
    // autonegotiation has completed.
    if (current_link_status && !self->mac_speed_configured) {
        // Re-verify link is still up before proceeding (it may have dropped).
        if (!self->last_link_status) {
            return;
        }

        bsr = eth_phy_read(self->phy_addr, PHY_BSR);
        bool autoneg_timeout = (mp_hal_ticks_ms() - self->autoneg_start_ms) > PHY_AUTONEG_TIMEOUT_MS;

        if (!(bsr & PHY_BSR_AUTONEG_DONE) && !autoneg_timeout) {
            return;
        }

