micropython/micropython/ports/stm32/eth.c
        // Read negotiated speed/duplex.
        uint16_t phy_speed = self->phy_get_link_status(self->phy_addr);
        if (autoneg_timeout && phy_speed == 0) {
            // Couldn't read speed; fall back to 10Mbps Half-Duplex.
            phy_speed = PHY_SPEED_10HALF;
            mp_printf(&mp_plat_print, "ETH: Autonegotiation timeout, using 10Mbps Half-Duplex\n");
        }

        self->mac_reconfig_in_progress = true;

        uint32_t maccr = ETH->MACCR;
        // Stop TX/RX before changing speed/duplex.
        maccr &= ~(ETH_MACCR_TE | ETH_MACCR_RE);
        ETH->MACCR = maccr;

        #if defined(STM32N6)
        // N6: PS=1 selects 10/100Mbit, FES selects 100 vs 10. PS=0 selects 1000Mbit.
        maccr &= ~(ETH_MACCR_FES | ETH_MACCR_DM | ETH_MACCR_PS);
        if (phy_speed == PHY_SPEED_1000FULL) {
            maccr |= ETH_MACCR_DM;
        } else if (phy_speed == PHY_SPEED_1000HALF) {
            // All bits clear (default).
        } else if (phy_speed == PHY_SPEED_100FULL) {
            maccr |= ETH_MACCR_FES | ETH_MACCR_PS | ETH_MACCR_DM;
        } else if (phy_speed == PHY_SPEED_100HALF) {
            maccr |= ETH_MACCR_FES | ETH_MACCR_PS;
        } else if (phy_speed == PHY_SPEED_10FULL) {
            maccr |= ETH_MACCR_PS | ETH_MACCR_DM;
        } else {
            maccr |= ETH_MACCR_PS;
        }
        #else
        maccr &= ~(ETH_MACCR_FES | ETH_MACCR_DM);
        if (phy_speed == PHY_SPEED_100FULL) {
            maccr |= ETH_MACCR_FES | ETH_MACCR_DM;
        } else if (phy_speed == PHY_SPEED_100HALF) {
            maccr |= ETH_MACCR_FES;
        } else if (phy_speed == PHY_SPEED_10FULL) {
            maccr |= ETH_MACCR_DM;
        }
        // else 10HALF: both bits clear.
        #endif

        ETH->MACCR = maccr;
        ETH->MACCR |= ETH_MACCR_TE | ETH_MACCR_RE;

        self->mac_reconfig_in_progress = false;
        self->mac_speed_configured = true;

        // MAC was reconfigured; restart DHCP if needed.
        struct netif *netif = &self->netif;
        MICROPY_PY_LWIP_ENTER
        eth_dhcp_restart_if_needed(netif);
        MICROPY_PY_LWIP_EXIT
    }
}

static void eth_process_frame(eth_t *self, size_t len, const uint8_t *buf) {
    eth_trace(self, len, buf, NETUTILS_TRACE_NEWLINE);

    struct netif *netif = &self->netif;
    if (netif->flags & NETIF_FLAG_LINK_UP) {
        struct pbuf *p = pbuf_alloc(PBUF_RAW, len, PBUF_POOL);
        if (p != NULL) {
            pbuf_take(p, buf, len);
            if (netif->input(p, netif) != ERR_OK) {
                pbuf_free(p);
            }
        }
    }
}

struct netif *eth_netif(eth_t *self) {
    return &self->netif;
}

int eth_link_status(eth_t *self) {
    struct netif *netif = &self->netif;
    if ((netif->flags & (NETIF_FLAG_UP | NETIF_FLAG_LINK_UP))
        == (NETIF_FLAG_UP | NETIF_FLAG_LINK_UP)) {
        if (netif->ip_addr.addr != 0) {
            return 3; // link up
        } else {
            return 2; // link no-ip;
        }
    } else {
        // When enabled, use the cached link status from the background poll.
        // When not enabled, do a direct PHY read (with double-read to flush
        // the IEEE 802.3 latched-low link status bit).
        bool physical_link_up;
        if (self->enabled) {
            physical_link_up = self->last_link_status;
        } else {
            (void)eth_phy_read(self->phy_addr, PHY_BSR);
            physical_link_up = (eth_phy_read(self->phy_addr, PHY_BSR) & PHY_BSR_LINK_STATUS) != 0;
        }
        return physical_link_up ? 1 : 0;
    }
}

bool eth_is_enabled(eth_t *self) {
    return self->enabled;
}

int eth_start(eth_t *self) {
    // Make sure Eth is not in low power mode.
    eth_low_power_mode(self, false);

    int ret = eth_mac_init(self);
    if (ret < 0) {
        return ret;
    }

    // Initialise the PHY (resets and starts autonegotiation, non-blocking).
    ret = eth_phy_init(self);
    if (ret < 0) {
        eth_mac_deinit(self);
        return ret;
    }

    MICROPY_PY_LWIP_ENTER
    struct netif *n = &self->netif;
    netif_set_default(n);
    netif_set_up(n);
    MICROPY_PY_LWIP_EXIT

    self->enabled = true;
    self->last_link_status = false;
    self->mac_speed_configured = false;

    // Run an initial poll so that if the link is already up, autoneg can
    // start being observed immediately.
    eth_phy_link_status_poll();

    return 0;
}

int eth_stop(eth_t *self) {
    self->enabled = false;
    self->last_link_status = false;
    self->mac_speed_configured = false;

    MICROPY_PY_LWIP_ENTER
    struct netif *n = &self->netif;
    if (netif_dhcp_data(n) != NULL) {
        dhcp_stop(n);
    }
    netif_set_link_down(n);
    netif_set_down(n);
    MICROPY_PY_LWIP_EXIT

    // Put PHY into low-power mode.
    eth_low_power_mode(self, true);
    eth_mac_deinit(self);
    return 0;
}

void eth_low_power_mode(eth_t *self, bool enable) {
    (void)self;

    // Enable eth clock
    #if defined(STM32H7)
    __HAL_RCC_ETH1MAC_CLK_ENABLE();
    #elif defined(STM32N6)
    __HAL_RCC_ETH1_CLK_ENABLE();
    #else
    __HAL_RCC_ETH_CLK_ENABLE();
    #endif

    uint16_t bcr = eth_phy_read(self->phy_addr, PHY_BCR);
    if (enable) {
        // Enable low-power mode.
        eth_phy_write(self->phy_addr, PHY_BCR, bcr | PHY_BCR_POWER_DOWN);
        // Disable eth clock.
        #if defined(STM32H7)
        __HAL_RCC_ETH1MAC_CLK_DISABLE();
        #elif defined(STM32N6)
        __HAL_RCC_ETH1_CLK_DISABLE();
        #else
        __HAL_RCC_ETH_CLK_DISABLE();
        #endif
    } else {
        // Disable low-power mode.
        eth_phy_write(self->phy_addr, PHY_BCR, bcr & (~PHY_BCR_POWER_DOWN));
    }
}
#endif // defined(MICROPY_HW_ETH_MDC)
